---
kind: property
id: P:Autodesk.Revit.DB.HomeCamera.EyePosition
source: html/7727684d-df0c-0d4c-03e1-e6b77cf0415c.htm
---
# Autodesk.Revit.DB.HomeCamera.EyePosition Property

The eye position point.

## Syntax (C#)
```csharp
public XYZ EyePosition { get; }
```